proj2/app/views/trainers/show.html.erb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 6]]
---
<p><b>Pokemon</b>
	<% @trainer.pokemon.each do |pokemon| %>