app/controllers/pokemons_controller.rb

  def capture
  	@pokemon = Pokemon.find(params[:id])
  	@pokemon.trainer_id = current_trainer.id
  	@pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 6], ["updated_at", "2015-10-30 04:27:27.929665"], ["id", 8]]

  def damage
  	@pokemon = Pokemon.find(params[:id])
  	@pokemon.health -= 10
  	@pokemon.save
  	if @pokemon.health <= 0
  		@pokemon.destroy
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2015-10-30 20:19:17.075473"], ["id", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 1]]

  def create
  	@pokemon = Pokemon.create(pokemon_params)
  	@pokemon.health = 100
  	if params[:pokemon][:name] == "charizard100"
  		@pokemon.level = 100
  	else
  		@pokemon.level = 1
  	end

    @pokemon.trainer_id = current_trainer.id
    if @pokemon.save
---
INSERT INTO "pokemons" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "kjhg"], ["created_at", "2015-10-30 21:03:26.332763"], ["updated_at", "2015-10-30 21:03:26.332763"]]
UPDATE "pokemons" SET "health" = ?, "level" = ?, "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 100], ["level", "1"], ["trainer_id", 5], ["updated_at", "2015-10-30 21:13:59.787686"], ["id", 17]]