proj2/app/controllers/trainers_controller.rb

SELECT "trainers".* FROM "trainers"
---
  def index
    @trainers = Trainer.all

SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ?  ORDER BY "trainers"."id" ASC LIMIT 1  [["id", 6]]
---
  def show
    @trainer = Trainer.find(params[:id])